SoapAPI/src/test/resources/postBookRental.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://api.soap.it.p.lodz.pl/">
    <soapenv:Header/>
    <soapenv:Body>
        <api:addSingleBookRentalToStorage>
            <!--Optional:-->
            <arg0>
                <!--Optional:-->
                <book>
                    <title>Doctor Sleep</title>
                    <author>Stephen King</author>
                    <pages>656</pages>
                    <rented>false</rented>
                    <id>testArg0</id>
                </book>
                <!--Optional:-->
                <pl.lodz.p.it.rentviewports.account>
                    <firstName>Jan</firstName>
                    <lastName>Kowalski</lastName>
                    <roleOfUser>USER</roleOfUser>
                    <isActive>true</isActive>
                    <id>testArg1</id>
                    <login>jan12</login>
                    <password>kowalski</password>
                </pl.lodz.p.it.rentviewports.account>
                <!--Optional:-->
                <id>testArg2</id>
            </arg0>
        </api:addSingleBookRentalToStorage>
    </soapenv:Body>
</soapenv:Envelope>